app/views/batting_stats/_form.html.erb

    <%= f.label "Player" %><br />
    <%= f.collection_select(:player_id,  Player.find(:all), :id, :first_and_last_name , {:include_blank=>'Select a Player',:selected=>[@batting_stat.player_id]})%>
---
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1