app/views/batting_stats/index.html.erb

  <tr>
    <td><%= batting_stat.player.first_name %></td>
---
SELECT "players".* FROM "players" WHERE "players"."id" IN (1)