app/controllers/batting_stats_controller.rb

  def index
    @batting_stats = BattingStat.includes(:player).all
---
SELECT "batting_stats".* FROM "batting_stats"
SELECT "players".* FROM "players" WHERE "players"."id" IN (1)

  def show
    @batting_stat = BattingStat.find(params[:id])
---
SELECT "batting_stats".* FROM "batting_stats" WHERE "batting_stats"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @batting_stat = BattingStat.find(params[:id])
---
SELECT "batting_stats".* FROM "batting_stats" WHERE "batting_stats"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @batting_stat = BattingStat.new(params[:batting_stat])

    respond_to do |format|
      if @batting_stat.save
---
INSERT INTO "batting_stats" ("at_bats", "created_at", "doubles", "hits", "home_runs", "legacy_id", "player_id", "runs_batted", "triples", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @batting_stat = BattingStat.find(params[:id])
---
SELECT "batting_stats".* FROM "batting_stats" WHERE "batting_stats"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    @batting_stat = BattingStat.find(params[:id])
    @batting_stat.destroy
---
SELECT "batting_stats".* FROM "batting_stats" WHERE "batting_stats"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "batting_stats" WHERE "batting_stats"."id" = $1  [["id", 2]]