app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT "leagues".* FROM "leagues"

  def show
    @league = League.includes(:photos).find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @league = League.find(params[:id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @league = League.new(params[:league])

    respond_to do |format|
      if @league.save
---
INSERT INTO "leagues" ("created_at", "league_name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 13 Jun 2014 21:05:43 UTC +00:00], ["league_name", "National League"], ["updated_at", Fri, 13 Jun 2014 21:05:43 UTC +00:00]]