app/controllers/photos_controller.rb

  def index
   # @photos = Photo.all

   @imageable = find_imageable
   @photos= if !(@imageable.nil?)
     @imageable.photos
   else
     Photo.all
---
SELECT "photos".* FROM "photos"

  def show
    @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
      @photo =Photo.new(:imageable_id=>params[:photo][:imageable_id], :imageable_type=>params[:photo][:imageable_type],:file_name=>params[:photo][:file_name],:photo_name=>params[:photo][:photo_name])
      if @photo.save
---
INSERT INTO "photos" ("created_at", "file_name", "imageable_id", "imageable_type", "photo_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "photos" SET "photo_name" = 'Chase Anderson', "file_name" = 'canderson1.jpg', "updated_at" = '2014-06-13 23:19:31.323192' WHERE "photos"."id" = 1

  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 4]]