app/controllers/players_controller.rb

SELECT "players".* FROM "players"
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (1)
---
  def index
    @players = Player.includes(:team).all

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @player = Player.includes(:photos,:team).find(params[:id])

SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO "players" ("created_at", "first_name", "last_name", "legacy_id", "team_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Fri, 13 Jun 2014 21:21:48 UTC +00:00], ["first_name", "Chase"], ["last_name", "Anderson"], ["legacy_id", ""], ["team_id", 1], ["updated_at", Fri, 13 Jun 2014 21:21:48 UTC +00:00]]
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save