app/controllers/teams_controller.rb

  def index
    @teams = Team.includes(:league).all
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" IN (1)
SELECT "teams".* FROM "teams"

  def show
    @team = Team.includes(:photos).find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("created_at", "league_id", "owner_name", "team_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 13 Jun 2014 21:08:42 UTC +00:00], ["league_id", 1], ["owner_name", "Ken Kendrick"], ["team_name", "Arizona Diamondbacks"], ["updated_at", Fri, 13 Jun 2014 21:08:42 UTC +00:00]]